# Data Merging

In [2]:
import pandas as pd 

# Example datasts for data merging 
# Dataset 1. India Individuals
data1 = {
    'id': [1, 2, 3],
    'name': ['Saurabh', 'Prashant', 'Rajesh'],
    'age': [28, 32, 24]
}


df1= pd.DataFrame(data1)
df1.head()

   id      name  age
0   1   Saurabh   28
1   2  Prashant   32
2   3    Rajesh   24

In [4]:
# dataset 2: Additional Information 

data2={
    'id': [1, 2, 3],
    'city': ['Bihar Sharif', 'Patna', 'Gaya'],
    'occupation': ['Engineer', 'Doctor', 'Teacher']
}

df2 = pd.DataFrame(data2)

df2.head()

   id          city occupation
0   1  Bihar Sharif   Engineer
1   2         Patna     Doctor
2   3          Gaya    Teacher

In [5]:
# Merging DataFrames on 'id'01_installation.ipynb

merged_df = pd.merge(df1, df2, on='id', how='inner')

merged_df.head()

   id      name  age          city occupation
0   1   Saurabh   28  Bihar Sharif   Engineer
1   2  Prashant   32         Patna     Doctor
2   3    Rajesh   24          Gaya    Teacher

## Concatenation

In [8]:
import pandas as pd 

# Example datasets for India context

# Dataset 1 - India names and Ages
data1 = {'Name': ['Saurabh', 'Prashant', 'Rajesh'], 'Age': [28, 32, 24]}
# Dataset 2 - More Indian Names and Ages
data2 = {'Name': ['Rahul', 'Urmila', 'Rakesh'], 'Age': [29, 35, 27]}
# Dataset 3 - Cities and Provinces in Indian
data3 = {'City': ['Bihar Sharif', 'Patna', 'Gaya'], 'Province': ['Delhi', 'Punjab', 'Ranchi']}

In [9]:
df1 = pd.DataFrame(data1)

df2 = pd.DataFrame(data2)

df3 = pd.DataFrame(data3)

In [10]:
# Concatenating Rows

concatenated_row = pd.concat([df1, df2])

In [12]:
# Concatenationg Columns
# Note: For a meaningful columns-wise concatenation, dataframes should have to same number of rows.

concatenated_columns = pd.concat([df1, df3], axis=1)

print(concatenated_row)

print("XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX")
print(concatenated_columns)

       Name  Age
0   Saurabh   28
1  Prashant   32
2    Rajesh   24
0     Rahul   29
1    Urmila   35
2    Rakesh   27
XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX
       Name  Age          City Province
0   Saurabh   28  Bihar Sharif    Delhi
1  Prashant   32         Patna   Punjab
2    Rajesh   24          Gaya   Ranchi